Confirmed, the example code works fine under Mac OS X Big Sur!

<details>
  <summary>Fargate example **succeeds on Mac OS Big Sur** with module v17.20.0 and Terraform 1.0.8</summary>
  
```
bretamogilefsky@BretAMogilefsky’s test % curl -L --output 17.zip https://github.com/terraform-aws-modules/terraform-aws-eks/archive/refs/tags/v17.20.0.zip
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   156  100   156    0     0    661      0 --:--:-- --:--:-- --:--:--   661
100  131k    0  131k    0     0   220k      0 --:--:-- --:--:-- --:--:--  482k
bretamogilefsky@BretAMogilefsky’s test % unzip 17.zip
Archive:  17.zip
284b038bfda29800d2203d1fce939204c944fd70
   creating: terraform-aws-eks-17.20.0/
   creating: terraform-aws-eks-17.20.0/.chglog/
  inflating: terraform-aws-eks-17.20.0/.chglog/CHANGELOG.tpl.md  
  inflating: terraform-aws-eks-17.20.0/.chglog/config.yml  
  inflating: terraform-aws-eks-17.20.0/.editorconfig  
   creating: terraform-aws-eks-17.20.0/.github/
  inflating: terraform-aws-eks-17.20.0/.github/CONTRIBUTING.md  
  inflating: terraform-aws-eks-17.20.0/.github/ISSUE_TEMPLATE.md  
  inflating: terraform-aws-eks-17.20.0/.github/PULL_REQUEST_TEMPLATE.md  
  inflating: terraform-aws-eks-17.20.0/.github/semantic.yml  
  inflating: terraform-aws-eks-17.20.0/.github/stale.yml  
   creating: terraform-aws-eks-17.20.0/.github/workflows/
  inflating: terraform-aws-eks-17.20.0/.github/workflows/changelog-check.yaml  
  inflating: terraform-aws-eks-17.20.0/.github/workflows/pre-commit.yml  
  inflating: terraform-aws-eks-17.20.0/.gitignore  
  inflating: terraform-aws-eks-17.20.0/.pre-commit-config.yaml  
  inflating: terraform-aws-eks-17.20.0/CHANGELOG.md  
  inflating: terraform-aws-eks-17.20.0/CHANGELOG.pre-v11.0.0.md  
  inflating: terraform-aws-eks-17.20.0/LICENSE  
  inflating: terraform-aws-eks-17.20.0/Makefile  
  inflating: terraform-aws-eks-17.20.0/README.md  
  inflating: terraform-aws-eks-17.20.0/aws_auth.tf  
  inflating: terraform-aws-eks-17.20.0/data.tf  
   creating: terraform-aws-eks-17.20.0/docs/
  inflating: terraform-aws-eks-17.20.0/docs/autoscaling.md  
  inflating: terraform-aws-eks-17.20.0/docs/enable-docker-bridge-network.md  
  inflating: terraform-aws-eks-17.20.0/docs/faq.md  
  inflating: terraform-aws-eks-17.20.0/docs/iam-permissions.md  
  inflating: terraform-aws-eks-17.20.0/docs/spot-instances.md  
  inflating: terraform-aws-eks-17.20.0/docs/upgrades.md  
   creating: terraform-aws-eks-17.20.0/examples/
   creating: terraform-aws-eks-17.20.0/examples/_bootstrap/
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/_bootstrap/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/bottlerocket/
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/userdata.toml  
 extracting: terraform-aws-eks-17.20.0/examples/bottlerocket/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/complete/
  inflating: terraform-aws-eks-17.20.0/examples/complete/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/complete/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/complete/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/complete/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/complete/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/fargate/
  inflating: terraform-aws-eks-17.20.0/examples/fargate/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/fargate/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/instance_refresh/
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/irsa/
  inflating: terraform-aws-eks-17.20.0/examples/irsa/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/cluster-autoscaler-chart-values.yaml  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/irsa.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/locals.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/irsa/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/launch_templates/pre_userdata.sh  
 extracting: terraform-aws-eks-17.20.0/examples/launch_templates/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/disk_encryption_policy.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/launchtemplate.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/outputs.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/templates/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/managed_node_groups/
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/secrets_encryption/
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/versions.tf  
  inflating: terraform-aws-eks-17.20.0/fargate.tf  
  inflating: terraform-aws-eks-17.20.0/irsa.tf  
  inflating: terraform-aws-eks-17.20.0/kubectl.tf  
  inflating: terraform-aws-eks-17.20.0/locals.tf  
  inflating: terraform-aws-eks-17.20.0/main.tf  
   creating: terraform-aws-eks-17.20.0/modules/
   creating: terraform-aws-eks-17.20.0/modules/fargate/
  inflating: terraform-aws-eks-17.20.0/modules/fargate/README.md  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/main.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/variables.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/versions.tf  
   creating: terraform-aws-eks-17.20.0/modules/node_groups/
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/README.md  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/launch_template.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/locals.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/outputs.tf  
   creating: terraform-aws-eks-17.20.0/modules/node_groups/templates/
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/versions.tf  
  inflating: terraform-aws-eks-17.20.0/node_groups.tf  
  inflating: terraform-aws-eks-17.20.0/outputs.tf  
   creating: terraform-aws-eks-17.20.0/templates/
  inflating: terraform-aws-eks-17.20.0/templates/kubeconfig.tpl  
  inflating: terraform-aws-eks-17.20.0/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/templates/userdata_windows.tpl  
   creating: terraform-aws-eks-17.20.0/tools/
  inflating: terraform-aws-eks-17.20.0/tools/semtag  
  inflating: terraform-aws-eks-17.20.0/variables.tf  
  inflating: terraform-aws-eks-17.20.0/versions.tf  
  inflating: terraform-aws-eks-17.20.0/workers.tf  
  inflating: terraform-aws-eks-17.20.0/workers_launch_template.tf  
bretamogilefsky@BretAMogilefsky’s test % cd terraform-aws-eks-17.20.0/examples/_bootstrap 
bretamogilefsky@BretAMogilefsky’s _bootstrap % terraform version
Terraform v1.0.8
on darwin_amd64
bretamogilefsky@BretAMogilefsky’s _bootstrap % terraform init
Initializing modules...
Downloading terraform-aws-modules/vpc/aws 3.7.0 for vpc...
- vpc in .terraform/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Finding hashicorp/kubernetes versions matching ">= 1.11.0"...
- Finding hashicorp/aws versions matching ">= 3.22.0, >= 3.38.0"...
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.5.0...
- Installed hashicorp/kubernetes v2.5.0 (signed by HashiCorp)
- Installing hashicorp/aws v3.61.0...
- Installed hashicorp/aws v3.61.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bretamogilefsky@BretAMogilefsky’s _bootstrap % terraform version
Terraform v1.0.8
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v3.61.0
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
+ provider registry.terraform.io/hashicorp/random v3.1.0
bretamogilefsky@BretAMogilefsky’s _bootstrap % terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "bootstrap-example"
        }
      + tags_all = {
          + "Name" = "bootstrap-example"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1a"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1b"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1c"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-public"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.10.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.11.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.12.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "bootstrap-example"
        }
      + tags_all                         = {
          + "Name" = "bootstrap-example"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name = (known after apply)
  + region       = "eu-west-1"
  + vpc          = {
      + azs                                         = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + cgw_arns                                    = []
      + cgw_ids                                     = []
      + database_internet_gateway_route_id          = ""
      + database_ipv6_egress_route_id               = ""
      + database_nat_gateway_route_ids              = []
      + database_network_acl_arn                    = ""
      + database_network_acl_id                     = ""
      + database_route_table_association_ids        = []
      + database_route_table_ids                    = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + database_subnet_arns                        = []
      + database_subnet_group                       = ""
      + database_subnet_group_name                  = ""
      + database_subnets                            = []
      + database_subnets_cidr_blocks                = []
      + database_subnets_ipv6_cidr_blocks           = []
      + default_network_acl_id                      = (known after apply)
      + default_route_table_id                      = (known after apply)
      + default_security_group_id                   = (known after apply)
      + default_vpc_arn                             = ""
      + default_vpc_cidr_block                      = ""
      + default_vpc_default_network_acl_id          = ""
      + default_vpc_default_route_table_id          = ""
      + default_vpc_default_security_group_id       = ""
      + default_vpc_enable_dns_hostnames            = ""
      + default_vpc_enable_dns_support              = ""
      + default_vpc_id                              = ""
      + default_vpc_instance_tenancy                = ""
      + default_vpc_main_route_table_id             = ""
      + dhcp_options_id                             = ""
      + egress_only_internet_gateway_id             = ""
      + elasticache_network_acl_arn                 = ""
      + elasticache_network_acl_id                  = ""
      + elasticache_route_table_association_ids     = []
      + elasticache_route_table_ids                 = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + elasticache_subnet_arns                     = []
      + elasticache_subnet_group                    = ""
      + elasticache_subnet_group_name               = ""
      + elasticache_subnets                         = []
      + elasticache_subnets_cidr_blocks             = []
      + elasticache_subnets_ipv6_cidr_blocks        = []
      + igw_arn                                     = (known after apply)
      + igw_id                                      = (known after apply)
      + intra_network_acl_arn                       = ""
      + intra_network_acl_id                        = ""
      + intra_route_table_association_ids           = []
      + intra_route_table_ids                       = []
      + intra_subnet_arns                           = []
      + intra_subnets                               = []
      + intra_subnets_cidr_blocks                   = []
      + intra_subnets_ipv6_cidr_blocks              = []
      + name                                        = "bootstrap-example"
      + nat_ids                                     = []
      + nat_public_ips                              = []
      + natgw_ids                                   = []
      + outpost_network_acl_arn                     = ""
      + outpost_network_acl_id                      = ""
      + outpost_subnet_arns                         = []
      + outpost_subnets                             = []
      + outpost_subnets_cidr_blocks                 = []
      + outpost_subnets_ipv6_cidr_blocks            = []
      + private_ipv6_egress_route_ids               = []
      + private_nat_gateway_route_ids               = []
      + private_network_acl_arn                     = ""
      + private_network_acl_id                      = ""
      + private_route_table_association_ids         = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_route_table_ids                     = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnet_arns                         = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnets                             = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnets_cidr_blocks                 = [
          + "10.0.10.0/24",
          + "10.0.11.0/24",
          + "10.0.12.0/24",
        ]
      + private_subnets_ipv6_cidr_blocks            = [
          + null,
          + null,
          + null,
        ]
      + public_internet_gateway_ipv6_route_id       = ""
      + public_internet_gateway_route_id            = (known after apply)
      + public_network_acl_arn                      = ""
      + public_network_acl_id                       = ""
      + public_route_table_association_ids          = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_route_table_ids                      = [
          + (known after apply),
        ]
      + public_subnet_arns                          = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_subnets                              = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_subnets_cidr_blocks                  = [
          + "10.0.0.0/24",
          + "10.0.1.0/24",
          + "10.0.2.0/24",
        ]
      + public_subnets_ipv6_cidr_blocks             = [
          + null,
          + null,
          + null,
        ]
      + redshift_network_acl_arn                    = ""
      + redshift_network_acl_id                     = ""
      + redshift_public_route_table_association_ids = []
      + redshift_route_table_association_ids        = []
      + redshift_route_table_ids                    = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + redshift_subnet_arns                        = []
      + redshift_subnet_group                       = ""
      + redshift_subnets                            = []
      + redshift_subnets_cidr_blocks                = []
      + redshift_subnets_ipv6_cidr_blocks           = []
      + this_customer_gateway                       = {}
      + vgw_arn                                     = ""
      + vgw_id                                      = ""
      + vpc_arn                                     = (known after apply)
      + vpc_cidr_block                              = "10.0.0.0/16"
      + vpc_enable_dns_hostnames                    = true
      + vpc_enable_dns_support                      = true
      + vpc_flow_log_cloudwatch_iam_role_arn        = ""
      + vpc_flow_log_destination_arn                = ""
      + vpc_flow_log_destination_type               = "cloud-watch-logs"
      + vpc_flow_log_id                             = ""
      + vpc_id                                      = (known after apply)
      + vpc_instance_tenancy                        = "default"
      + vpc_ipv6_association_id                     = (known after apply)
      + vpc_ipv6_cidr_block                         = (known after apply)
      + vpc_main_route_table_id                     = (known after apply)
      + vpc_owner_id                                = (known after apply)
      + vpc_secondary_cidr_blocks                   = []
    }
random_string.suffix: Creating...
random_string.suffix: Creation complete after 0s [id=ux8tMCMQ]
module.vpc.aws_vpc.this[0]: Creating...
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Still creating... [20s elapsed]
module.vpc.aws_vpc.this[0]: Creation complete after 28s [id=vpc-0a31abb827eac6632]
module.vpc.aws_route_table.private[2]: Creating...
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_subnet.public[2]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_subnet.private[2]: Creating...
module.vpc.aws_route_table.private[1]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_route_table.private[2]: Creation complete after 2s [id=rtb-052218e00c00d14e2]
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 2s [id=rtb-05e24241e4ceaf639]
module.vpc.aws_route_table.private[1]: Creation complete after 2s [id=rtb-043eda5ea3546c65f]
module.vpc.aws_route_table.private[0]: Creation complete after 2s [id=rtb-07016d899812736e5]
module.vpc.aws_subnet.private[0]: Creation complete after 3s [id=subnet-0a7ca8938a63ccbdb]
module.vpc.aws_subnet.private[1]: Creation complete after 3s [id=subnet-06b80f331f2126291]
module.vpc.aws_subnet.private[2]: Creation complete after 3s [id=subnet-0e0406689472c6521]
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_route_table_association.private[2]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creation complete after 4s [id=igw-0a878938d2d0cd9f5]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_route_table_association.private[1]: Creation complete after 2s [id=rtbassoc-0c8d7b839f231ddef]
module.vpc.aws_route_table_association.private[2]: Creation complete after 2s [id=rtbassoc-0e8ca1796e16f6d42]
module.vpc.aws_route_table_association.private[0]: Creation complete after 2s [id=rtbassoc-0858563d989b3c9a3]
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 3s [id=r-rtb-05e24241e4ceaf6391080289494]
module.vpc.aws_subnet.public[2]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[1]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[2]: Creation complete after 15s [id=subnet-0fb0961559486af03]
module.vpc.aws_subnet.public[1]: Creation complete after 15s [id=subnet-06b7532506766a107]
module.vpc.aws_subnet.public[0]: Creation complete after 15s [id=subnet-06b88e5766d462105]
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_route_table_association.public[2]: Creating...
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_route_table_association.public[0]: Creation complete after 3s [id=rtbassoc-0bc8045cd5232af61]
module.vpc.aws_route_table_association.public[1]: Creation complete after 3s [id=rtbassoc-0942ba96980c972cb]
module.vpc.aws_route_table_association.public[2]: Creation complete after 3s [id=rtbassoc-049cb335f215c6692]

Apply complete! Resources: 20 added, 0 changed, 0 destroyed.

Outputs:

cluster_name = "test-eks-ux8tMCMQ"
region = "eu-west-1"
vpc = {
  "azs" = tolist([
    "eu-west-1a",
    "eu-west-1b",
    "eu-west-1c",
  ])
  "cgw_arns" = []
  "cgw_ids" = []
  "database_internet_gateway_route_id" = ""
  "database_ipv6_egress_route_id" = ""
  "database_nat_gateway_route_ids" = []
  "database_network_acl_arn" = ""
  "database_network_acl_id" = ""
  "database_route_table_association_ids" = []
  "database_route_table_ids" = tolist([
    "rtb-07016d899812736e5",
    "rtb-043eda5ea3546c65f",
    "rtb-052218e00c00d14e2",
  ])
  "database_subnet_arns" = []
  "database_subnet_group" = ""
  "database_subnet_group_name" = ""
  "database_subnets" = []
  "database_subnets_cidr_blocks" = []
  "database_subnets_ipv6_cidr_blocks" = []
  "default_network_acl_id" = "acl-0be540d093a5a940a"
  "default_route_table_id" = "rtb-059b958d31194b4fe"
  "default_security_group_id" = "sg-0d9cfea77f58a14c9"
  "default_vpc_arn" = ""
  "default_vpc_cidr_block" = ""
  "default_vpc_default_network_acl_id" = ""
  "default_vpc_default_route_table_id" = ""
  "default_vpc_default_security_group_id" = ""
  "default_vpc_enable_dns_hostnames" = ""
  "default_vpc_enable_dns_support" = ""
  "default_vpc_id" = ""
  "default_vpc_instance_tenancy" = ""
  "default_vpc_main_route_table_id" = ""
  "dhcp_options_id" = ""
  "egress_only_internet_gateway_id" = ""
  "elasticache_network_acl_arn" = ""
  "elasticache_network_acl_id" = ""
  "elasticache_route_table_association_ids" = []
  "elasticache_route_table_ids" = tolist([
    "rtb-07016d899812736e5",
    "rtb-043eda5ea3546c65f",
    "rtb-052218e00c00d14e2",
  ])
  "elasticache_subnet_arns" = []
  "elasticache_subnet_group" = ""
  "elasticache_subnet_group_name" = ""
  "elasticache_subnets" = []
  "elasticache_subnets_cidr_blocks" = []
  "elasticache_subnets_ipv6_cidr_blocks" = []
  "igw_arn" = "arn:aws:ec2:eu-west-1:645945852371:internet-gateway/igw-0a878938d2d0cd9f5"
  "igw_id" = "igw-0a878938d2d0cd9f5"
  "intra_network_acl_arn" = ""
  "intra_network_acl_id" = ""
  "intra_route_table_association_ids" = []
  "intra_route_table_ids" = []
  "intra_subnet_arns" = []
  "intra_subnets" = []
  "intra_subnets_cidr_blocks" = []
  "intra_subnets_ipv6_cidr_blocks" = []
  "name" = "bootstrap-example"
  "nat_ids" = []
  "nat_public_ips" = tolist([])
  "natgw_ids" = []
  "outpost_network_acl_arn" = ""
  "outpost_network_acl_id" = ""
  "outpost_subnet_arns" = []
  "outpost_subnets" = []
  "outpost_subnets_cidr_blocks" = []
  "outpost_subnets_ipv6_cidr_blocks" = []
  "private_ipv6_egress_route_ids" = []
  "private_nat_gateway_route_ids" = []
  "private_network_acl_arn" = ""
  "private_network_acl_id" = ""
  "private_route_table_association_ids" = [
    "rtbassoc-0858563d989b3c9a3",
    "rtbassoc-0c8d7b839f231ddef",
    "rtbassoc-0e8ca1796e16f6d42",
  ]
  "private_route_table_ids" = [
    "rtb-07016d899812736e5",
    "rtb-043eda5ea3546c65f",
    "rtb-052218e00c00d14e2",
  ]
  "private_subnet_arns" = [
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0a7ca8938a63ccbdb",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-06b80f331f2126291",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0e0406689472c6521",
  ]
  "private_subnets" = [
    "subnet-0a7ca8938a63ccbdb",
    "subnet-06b80f331f2126291",
    "subnet-0e0406689472c6521",
  ]
  "private_subnets_cidr_blocks" = [
    "10.0.10.0/24",
    "10.0.11.0/24",
    "10.0.12.0/24",
  ]
  "private_subnets_ipv6_cidr_blocks" = [
    tostring(null),
    tostring(null),
    tostring(null),
  ]
  "public_internet_gateway_ipv6_route_id" = ""
  "public_internet_gateway_route_id" = "r-rtb-05e24241e4ceaf6391080289494"
  "public_network_acl_arn" = ""
  "public_network_acl_id" = ""
  "public_route_table_association_ids" = [
    "rtbassoc-0bc8045cd5232af61",
    "rtbassoc-0942ba96980c972cb",
    "rtbassoc-049cb335f215c6692",
  ]
  "public_route_table_ids" = [
    "rtb-05e24241e4ceaf639",
  ]
  "public_subnet_arns" = [
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-06b88e5766d462105",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-06b7532506766a107",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0fb0961559486af03",
  ]
  "public_subnets" = [
    "subnet-06b88e5766d462105",
    "subnet-06b7532506766a107",
    "subnet-0fb0961559486af03",
  ]
  "public_subnets_cidr_blocks" = [
    "10.0.0.0/24",
    "10.0.1.0/24",
    "10.0.2.0/24",
  ]
  "public_subnets_ipv6_cidr_blocks" = [
    tostring(null),
    tostring(null),
    tostring(null),
  ]
  "redshift_network_acl_arn" = ""
  "redshift_network_acl_id" = ""
  "redshift_public_route_table_association_ids" = []
  "redshift_route_table_association_ids" = []
  "redshift_route_table_ids" = tolist([
    "rtb-07016d899812736e5",
    "rtb-043eda5ea3546c65f",
    "rtb-052218e00c00d14e2",
  ])
  "redshift_subnet_arns" = []
  "redshift_subnet_group" = ""
  "redshift_subnets" = []
  "redshift_subnets_cidr_blocks" = []
  "redshift_subnets_ipv6_cidr_blocks" = []
  "this_customer_gateway" = {}
  "vgw_arn" = ""
  "vgw_id" = ""
  "vpc_arn" = "arn:aws:ec2:eu-west-1:645945852371:vpc/vpc-0a31abb827eac6632"
  "vpc_cidr_block" = "10.0.0.0/16"
  "vpc_enable_dns_hostnames" = true
  "vpc_enable_dns_support" = true
  "vpc_flow_log_cloudwatch_iam_role_arn" = ""
  "vpc_flow_log_destination_arn" = ""
  "vpc_flow_log_destination_type" = "cloud-watch-logs"
  "vpc_flow_log_id" = ""
  "vpc_id" = "vpc-0a31abb827eac6632"
  "vpc_instance_tenancy" = "default"
  "vpc_ipv6_association_id" = ""
  "vpc_ipv6_cidr_block" = ""
  "vpc_main_route_table_id" = "rtb-059b958d31194b4fe"
  "vpc_owner_id" = "645945852371"
  "vpc_secondary_cidr_blocks" = []
}
bretamogilefsky@BretAMogilefsky’s _bootstrap % cd ../fargate 
bretamogilefsky@BretAMogilefsky’s fargate % terraform init
Initializing modules...
- barebone_eks in ../..
- barebone_eks.fargate in ../../modules/fargate
- barebone_eks.node_groups in ../../modules/node_groups
- eks in ../..
- eks.fargate in ../../modules/fargate
- eks.node_groups in ../../modules/node_groups
- fargate_profile_existing_cluster in ../../modules/fargate

Initializing the backend...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding hashicorp/kubernetes versions matching ">= 1.11.0, >= 1.11.1"...
- Finding hashicorp/aws versions matching ">= 3.22.0, >= 3.40.0, >= 3.56.0"...
- Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
- Finding terraform-aws-modules/http versions matching ">= 2.4.1"...
- Finding hashicorp/local versions matching ">= 1.4.0"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Installing hashicorp/kubernetes v2.5.0...
- Installed hashicorp/kubernetes v2.5.0 (signed by HashiCorp)
- Installing hashicorp/aws v3.61.0...
- Installed hashicorp/aws v3.61.0 (signed by HashiCorp)
- Installing hashicorp/cloudinit v2.2.0...
- Installed hashicorp/cloudinit v2.2.0 (signed by HashiCorp)
- Installing terraform-aws-modules/http v2.4.1...
- Installed terraform-aws-modules/http v2.4.1 (self-signed, key ID B2C1C0641B6B0EB7)
- Installing hashicorp/local v2.1.0...
- Installed hashicorp/local v2.1.0 (signed by HashiCorp)
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bretamogilefsky@BretAMogilefsky’s fargate % terraform version
Terraform v1.0.8
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v3.61.0
+ provider registry.terraform.io/hashicorp/cloudinit v2.2.0
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
+ provider registry.terraform.io/hashicorp/local v2.1.0
+ provider registry.terraform.io/hashicorp/random v3.1.0
+ provider registry.terraform.io/terraform-aws-modules/http v2.4.1
bretamogilefsky@BretAMogilefsky’s fargate % terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.barebone will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "barebone"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.barebone will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "barebone"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.barebone_eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.barebone_eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "barebone-test-eks-ux8tMCMQ"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-06b80f331f2126291",
              + "subnet-0a7ca8938a63ccbdb",
              + "subnet-0e0406689472c6521",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "barebone-test-eks-ux8tMCMQ-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all    = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
    }

  # module.barebone_eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "barebone-test-eks-ux8tMCMQ"
      + path                  = "/"
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "barebone-test-eks-ux8tMCMQ"
      + path                  = "/"
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "barebone-test-eks-ux8tMCMQ"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
          + "Name"        = "barebone-test-eks-ux8tMCMQ-eks_cluster_sg"
        }
      + tags_all               = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
          + "Name"        = "barebone-test-eks-ux8tMCMQ-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-0a31abb827eac6632"
    }

  # module.barebone_eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "barebone-test-eks-ux8tMCMQ"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Barebone"                                         = "yes_please"
          + "Environment"                                      = "test"
          + "Name"                                             = "barebone-test-eks-ux8tMCMQ-eks_worker_sg"
          + "kubernetes.io/cluster/barebone-test-eks-ux8tMCMQ" = "owned"
        }
      + tags_all               = {
          + "Barebone"                                         = "yes_please"
          + "Environment"                                      = "test"
          + "Name"                                             = "barebone-test-eks-ux8tMCMQ-eks_worker_sg"
          + "kubernetes.io/cluster/barebone-test-eks-ux8tMCMQ" = "owned"
        }
      + vpc_id                 = "vpc-0a31abb827eac6632"
    }

  # module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.barebone_eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = jsonencode([])
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.barebone_eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_barebone-test-eks-ux8tMCMQ"
      + id                   = (known after apply)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "test-eks-ux8tMCMQ"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-06b7532506766a107",
              + "subnet-0a7ca8938a63ccbdb",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test-eks-ux8tMCMQ-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all    = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
    }

  # module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-ux8tMCMQ"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-ux8tMCMQ"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-eks-ux8tMCMQ"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Name"        = "test-eks-ux8tMCMQ-eks_cluster_sg"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Name"        = "test-eks-ux8tMCMQ-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-0a31abb827eac6632"
    }

  # module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-eks-ux8tMCMQ"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                             = "test"
          + "GithubOrg"                               = "terraform-aws-modules"
          + "GithubRepo"                              = "terraform-aws-eks"
          + "Name"                                    = "test-eks-ux8tMCMQ-eks_worker_sg"
          + "kubernetes.io/cluster/test-eks-ux8tMCMQ" = "owned"
        }
      + tags_all               = {
          + "Environment"                             = "test"
          + "GithubOrg"                               = "terraform-aws-modules"
          + "GithubRepo"                              = "terraform-aws-eks"
          + "Name"                                    = "test-eks-ux8tMCMQ-eks_worker_sg"
          + "kubernetes.io/cluster/test-eks-ux8tMCMQ" = "owned"
        }
      + vpc_id                 = "vpc-0a31abb827eac6632"
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_test-eks-ux8tMCMQ"
      + id                   = (known after apply)
    }

  # module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "profile1"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06b80f331f2126291",
          + "subnet-0a7ca8938a63ccbdb",
        ]
      + tags                   = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile1"
        }
      + tags_all               = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile1"
        }

      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "profile"
        }
      + selector {
          + labels    = {
              + "k8s-app" = "kube-dns"
            }
          + namespace = "kube-system"
        }
    }

  # module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "profile2"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06b80f331f2126291",
        ]
      + tags                   = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile2"
        }
      + tags_all               = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile2"
        }

      + selector {
          + labels    = {
              + "Fargate" = "profile2"
            }
          + namespace = "default"
        }
    }

  # module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DoYouLoveFargate" = "Yes"
        }
      + tags_all              = {
          + "DoYouLoveFargate" = "Yes"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate.aws_eks_fargate_profile.this["default"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "test-eks-ux8tMCMQ"
      + fargate_profile_name   = "default"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0e0406689472c6521",
        ]
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "default"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "default"
        }

      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "default"
        }
      + selector {
          + labels    = {
              + "k8s-app" = "kube-dns"
            }
          + namespace = "kube-system"
        }
    }

  # module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "test-eks-ux8tMCMQ"
      + fargate_profile_name   = "secondary"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06b80f331f2126291",
        ]
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "secondary"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "secondary"
        }

      + selector {
          + labels    = {
              + "Environment" = "test"
              + "GithubOrg"   = "terraform-aws-modules"
              + "GithubRepo"  = "terraform-aws-eks"
            }
          + namespace = "default"
        }
    }

  # module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-ux8tMCMQ-fargate"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint          = (known after apply)
  + cluster_security_group_id = (known after apply)
  + config_map_aws_auth       = []
  + fargate_profile_arns      = [
      + (known after apply),
      + (known after apply),
    ]
  + kubectl_config            = (known after apply)
module.barebone_eks.aws_security_group.workers[0]: Creating...
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_iam_role.cluster[0]: Creating...
module.barebone_eks.aws_security_group.cluster[0]: Creating...
module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_security_group.cluster[0]: Creating...
module.eks.aws_security_group.workers[0]: Creating...
module.barebone_eks.aws_iam_role.cluster[0]: Creating...
module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 1s [id=arn:aws:iam::645945852371:policy/barebone-test-eks-ux8tMCMQ-elb-sl-role-creation20211002051039988000000003]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 1s [id=arn:aws:iam::645945852371:policy/test-eks-ux8tMCMQ-elb-sl-role-creation20211002051039989400000005]
module.barebone_eks.aws_iam_role.cluster[0]: Creation complete after 2s [id=barebone-test-eks-ux8tMCMQ20211002051039995000000007]
module.eks.aws_iam_role.cluster[0]: Creation complete after 2s [id=test-eks-ux8tMCMQ20211002051039988900000004]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002051039995000000007-2021100205104193010000000a]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 0s [id=test-eks-ux8tMCMQ20211002051039988900000004-2021100205104193100000000b]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002051039995000000007-2021100205104193170000000d]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 0s [id=test-eks-ux8tMCMQ20211002051039988900000004-20211002051041929000000009]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002051039995000000007-2021100205104193120000000c]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002051039995000000007-2021100205104193590000000e]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ20211002051039988900000004-20211002051042865100000010]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ20211002051039988900000004-2021100205104284090000000f]
module.eks.aws_security_group.cluster[0]: Creation complete after 5s [id=sg-0e7fe5ff493ec3a4c]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.eks.aws_security_group.workers[0]: Creation complete after 5s [id=sg-022e18a05fa4ea34f]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.barebone_eks.aws_security_group.cluster[0]: Creation complete after 6s [id=sg-08146587c1aeaccf7]
module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 3s [id=sgrule-1620332261]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 3s [id=sgrule-1240251137]
module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 2s [id=sgrule-1227450359]
module.barebone_eks.aws_security_group.workers[0]: Still creating... [10s elapsed]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 6s [id=sgrule-2789626161]
module.eks.aws_eks_cluster.this[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 6s [id=sgrule-1479760287]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 8s [id=sgrule-3640983602]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Still creating... [10s elapsed]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 11s [id=sgrule-1824789451]
module.barebone_eks.aws_security_group.workers[0]: Still creating... [20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10s elapsed]
module.barebone_eks.aws_security_group.workers[0]: Still creating... [30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [20s elapsed]
module.barebone_eks.aws_security_group.workers[0]: Creation complete after 38s [id=sg-000264ff930a75128]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.eks.aws_eks_cluster.this[0]: Still creating... [30s elapsed]
module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 3s [id=sgrule-532761941]
module.barebone_eks.aws_eks_cluster.this[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 3s [id=sgrule-2975367876]
module.barebone_eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 7s [id=sgrule-2627535455]
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Still creating... [10s elapsed]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Still creating... [10s elapsed]
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 10s [id=sgrule-2922946960]
module.eks.aws_eks_cluster.this[0]: Still creating... [40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10s elapsed]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 13s [id=sgrule-3570070760]
module.eks.aws_eks_cluster.this[0]: Still creating... [50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [11m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [11m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [11m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [11m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [11m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Creation complete after 11m3s [id=barebone-test-eks-ux8tMCMQ]
module.barebone_eks.data.http.wait_for_cluster[0]: Reading...
module.barebone_eks.aws_iam_role.workers[0]: Creating...
module.barebone_eks.local_file.kubeconfig[0]: Creating...
module.barebone_eks.local_file.kubeconfig[0]: Creation complete after 0s [id=a49f83457585533ca42c62a867783824720a0fa8]
module.barebone_eks.aws_iam_role.workers[0]: Creation complete after 2s [id=barebone-test-eks-ux8tMCMQ20211002052223797300000011]
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002052223797300000011-20211002052226029000000012]
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002052223797300000011-20211002052226036400000014]
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creation complete after 0s [id=barebone-test-eks-ux8tMCMQ20211002052223797300000011-20211002052226036300000013]
module.barebone_eks.data.http.wait_for_cluster[0]: Read complete after 6s [id=https://2C3502BCDFE7E1DA52EC69242E9ED514.gr7.eu-west-1.eks.amazonaws.com/healthz]
data.aws_eks_cluster.barebone: Reading...
data.aws_eks_cluster_auth.barebone: Reading...
data.aws_eks_cluster_auth.barebone: Read complete after 0s [id=barebone-test-eks-ux8tMCMQ]
module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0]: Creating...
data.aws_eks_cluster.barebone: Read complete after 1s [id=barebone-test-eks-ux8tMCMQ]
module.eks.aws_eks_cluster.this[0]: Still creating... [11m40s elapsed]
module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0]: Creation complete after 2s [id=barebone-test-eks-ux8tMC-fargate20211002052229707500000015]
module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creating...
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Creating...
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Creating...
module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creation complete after 1s [id=barebone-test-eks-ux8tMC-fargate20211002052229707500000015-20211002052232212700000018]
module.eks.aws_eks_cluster.this[0]: Still creating... [11m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [10s elapsed]
module.eks.aws_eks_cluster.this[0]: Creation complete after 11m56s [id=test-eks-ux8tMCMQ]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster.cluster: Reading...
module.eks.aws_iam_role.workers[0]: Creating...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=test-eks-ux8tMCMQ]
module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0]: Creating...
module.eks.local_file.kubeconfig[0]: Creating...
module.eks.local_file.kubeconfig[0]: Creation complete after 0s [id=c42247623e54f1dcff3cc15d1cc47b9189affb89]
data.aws_eks_cluster.cluster: Read complete after 1s [id=test-eks-ux8tMCMQ]
module.barebone_eks.kubernetes_config_map.aws_auth[0]: Creating...
module.eks.aws_iam_role.workers[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ20211002052246759300000019]
module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ-fargate2021100205224677250000001a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creating...
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creating...
module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creating...
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Creating...
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Creating...
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ20211002052246759300000019-2021100205224899170000001d]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ20211002052246759300000019-2021100205224899670000001f]
module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ-fargate2021100205224677250000001a-20211002052249000200000020]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creation complete after 1s [id=test-eks-ux8tMCMQ20211002052246759300000019-2021100205224899170000001e]
module.barebone_eks.kubernetes_config_map.aws_auth[0]: Creation complete after 2s [id=kube-system/aws-auth]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Creation complete after 2m24s [id=barebone-test-eks-ux8tMCMQ:profile2]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Creation complete after 2m24s [id=test-eks-ux8tMCMQ:secondary]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m11s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m21s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Creation complete after 3m45s [id=barebone-test-eks-ux8tMCMQ:profile1]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m31s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m41s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m51s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Creation complete after 3m58s [id=test-eks-ux8tMCMQ:default]

Apply complete! Resources: 49 added, 0 changed, 0 destroyed.

Outputs:

cluster_endpoint = "https://[REDACTED].gr7.eu-west-1.eks.amazonaws.com"
cluster_security_group_id = "sg-0e7fe5ff493ec3a4c"
config_map_aws_auth = []
fargate_profile_arns = [
  "arn:aws:eks:eu-west-1:645945852371:fargateprofile/test-eks-ux8tMCMQ/default/8abe1fbb-5345-7799-def2-dfad71ed056e",
  "arn:aws:eks:eu-west-1:645945852371:fargateprofile/test-eks-ux8tMCMQ/secondary/4abe1fba-43b7-a195-6597-07c734c2436f",
]
kubectl_config = <<EOT
apiVersion: v1
preferences: {}
kind: Config

clusters:
- cluster:
    server: https://[REDACTED].gr7.eu-west-1.eks.amazonaws.com
    certificate-authority-data: [REDACTED]
  name: eks_test-eks-ux8tMCMQ

contexts:
- context:
    cluster: eks_test-eks-ux8tMCMQ
    user: eks_test-eks-ux8tMCMQ
  name: eks_test-eks-ux8tMCMQ

current-context: eks_test-eks-ux8tMCMQ

users:
- name: eks_test-eks-ux8tMCMQ
  user:
    exec:
      apiVersion: client.authentication.k8s.io/v1alpha1
      command: aws-iam-authenticator
      args:
        - "token"
        - "-i"
        - "test-eks-ux8tMCMQ"

EOT


```
</details>

I'll do some more digging to try to understand the cause, but can someone else confirm the problem is appearing under WSL2 in Windows 10?